/**
 * Created by Wuyang on 2016/1/14.
 */
var datas = {
    
  banks: [
            {
                
                "img": "", 
                "name": "中国工商银行"
            }, {
                
                "img": "", 
                "name": "中国农业银行"
            }, {
                
                "img": "", 
                "name": "中国银行"
            }, {
                
                "img": "", 
                "name": "中国建设银行"
            }, {
                
                "img": "", 
                "name": "交通银行"
            }, {
                
                "img": "", 
                "name": "中国邮政储蓄银行"
            }, {
                
                "img": "", 
                "name": "中国民生银行"
            }, {
                
                "img": "", 
                "name": "中信银行"
            }, {
                
                "img": "", 
                "name": "徽商银行"
            }, {
                
                "img": "", 
                "name": "招商银行"
            }, {
                
                "img": "", 
                "name": "中国光大银行"
            }, {
                
                "img": "", 
                "name": "广东发展银行"
            }, {
                
                "img": "", 
                "name": "深圳发展银行"
            }, {
                
                "img": "", 
                "name": "浦发银行"
            }, {
                
                "img": "", 
                "name": "华夏银行"
            }, {
                
                "img": "", 
                "name": "兴业银行"
            }, {
                
                "img": "", 
                "name": "上海银行"
            }, {
                
                "img": "", 
                "name": "北京银行"
            }, {
                
                "img": "", 
                "name": "平安银行"
            }, {
                "img": "", 
                "name": "中国农商银行"
            }
            
        ]
};